app/Helpers/settings_helper.php

SELECT *
FROM `settings`
 LIMIT 1
---
function settingsGet()
{
    $modelsettings = new \App\Models\SettingsModel;
    $data['settings'] = $modelsettings->first();