app/Filters/FirmaFilter.php

    public function before(RequestInterface $request, $arguments = null)
    {
        $db = \Config\Database::connect();

        $host = $_SERVER['HTTP_HOST'];
        $slug = explode('.', $host)[0];

        $firma = $db->table('firmalar')
                    ->where('firma_ad', $slug)
                    ->get()
                    ->getRow();
---
SELECT *
FROM `firmalar`
WHERE `firma_ad` = 'gariban'