app/Controllers/Anasayfa.php

SELECT *
FROM `settings`
WHERE `firma_id` = '6'
 LIMIT 1
SELECT *
FROM `categories`
WHERE `firma_id` = '6'
SELECT *
FROM `products`
WHERE `firma_id` = '6'
AND `is_active` = 1
SELECT *
FROM `settings`
WHERE `firma_id` = 1
 LIMIT 1
SELECT *
FROM `categories`
WHERE `firma_id` = 1
AND `is_active` = 1
SELECT *
FROM `status`
WHERE `firma_id` = '6'
---
  public function index()
  {
    $modelSettings = new \App\Models\SettingsModel();
    $data['settings'] = $modelSettings->where('firma_id', $this->firma->firma_id)->first();
    // Tek satır olduğu için first() kullandık, [0] yerine

    $modelcategories = new \App\Models\CategoryModel();
    $data['category'] = $modelcategories->where('firma_id', $this->firma->firma_id)->findAll();

    $modelproducts = new \App\Models\ProductsModel();
    $data['products'] = $modelproducts
      ->where('firma_id', $this->firma->firma_id)
      ->where('is_active', 1)
      ->findAll();

    $modelStatus = new \App\Models\StatusModel();
    $data['status'] = $modelStatus->where('firma_id', $this->firma->firma_id)->findAll();