app/Controllers/Home.php

    public function panel()
    {
        $modelcategories = new \App\Models\UserModel;
        $modelproducts = new \App\Models\ProductsModel;
        $modelEmploye = new \App\Models\KullaniciModel;
        $modelSettings = new \App\Models\SettingsModel();  // ekledik

        $data['category'] = $modelcategories->findAll();
        $data['product'] = $modelproducts->findAll();
        $data['activeProductCount'] = $modelproducts->where('is_active', 1)->countAllResults();
        $data['pasiveProductCount'] = $modelproducts->where('is_active', 0)->countAllResults();
        $data['employe'] = $modelEmploye->findAll();
        $data['categoryCount'] = count($data['category']);
        $data['productCount'] = count($data['product']);
        $data['employeCount'] =  count($data['employe']);

        $data['settings'] = $modelSettings->first(); // **settings ekledik**
---
SELECT *
FROM `categories`
SELECT *
FROM `products`
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `is_active` = 0
SELECT *
FROM `settings`
 LIMIT 1

    public function settingsView()
    {
        $modelSettings = new \App\Models\SettingsModel();
        $data['settings'] = $modelSettings->first(); // tek satır çekiyoruz
---
SELECT *
FROM `settings`
 LIMIT 1

    public function statusView()
    {
        $modelStatus = new \App\Models\StatusModel();
        $data['status'] = $modelStatus->first();
---
SELECT *
FROM `status`
 LIMIT 1