app/Controllers/Home.php

    public function panel()
    {
        $modelcategories = new \App\Models\CategoryModel;
        $modelproducts = new \App\Models\ProductsModel;
        $modelEmploye = new \App\Models\KullaniciModel;
        $modelSettings = new \App\Models\SettingsModel();  // ekledik
        $data['category'] = $modelcategories->where('firma_id', $this->firma->firma_id)->findAll();
        $data['product'] = $modelproducts->where('firma_id', $this->firma->firma_id)->findAll();
        $data['activeProductCount'] = $modelproducts
            ->where('firma_id', $this->firma->firma_id)
            ->where('is_active', 1)
            ->countAllResults();

        $data['pasiveProductCount'] = $modelproducts
            ->where('firma_id', $this->firma->firma_id)
            ->where('is_active', 0)
            ->countAllResults();
        $data['employe'] = $modelEmploye->where('firma_id', $this->firma->firma_id)->findAll();
        $data['categoryCount'] = count($data['category']);
        $data['productCount'] = count($data['product']);
        $data['employeCount'] =  count($data['employe']);

        $data['settings'] = $modelSettings->where('firma_id', $this->firma->firma_id)->first(); // **settings ekledik**
---
SELECT *
FROM `categories`
WHERE `firma_id` = '13'
SELECT *
FROM `products`
WHERE `firma_id` = '13'
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `firma_id` = '13'
AND `is_active` = 1
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `firma_id` = '13'
AND `is_active` = 0
SELECT *
FROM `settings`
WHERE `firma_id` = '13'
 LIMIT 1

    public function category()
    {
        $modelcategories = new \App\Models\CategoryModel;
        $data['category'] = $modelcategories->where('firma_id', $this->firma->firma_id)->findAll();
---
SELECT *
FROM `categories`
WHERE `firma_id` = '1'

    public function productsInfo($id, $info)
    {
        $modelproducts = new \App\Models\ProductsModel;
        $data['product'] = $modelproducts->find($id);
        if ($info == 1) {
            $productPassive = $modelproducts->where('id', $id)->where('firma_id', $this->firma->firma_id)->set('is_active', 0)->update();
---
SELECT *
FROM `products`
WHERE `firma_id` = '6'
AND `firma_id` = '6'

    public function categoryInfo($id, $info)
    {
        $modelcategory = new \App\Models\CategoryModel();
        $modelproducts = new \App\Models\ProductsModel();
        $data['product'] = $modelcategory->find($id);
        $session = session();
        if ($info == 1) {
            $categoryPassive = $modelcategory->where('id', $id)->where('firma_id', $this->firma->firma_id)->set('is_active', 0)->update();
            if ($categoryPassive) {
                $productPassive = $modelproducts->where('categories_id', $id)->where('firma_id', $this->firma->firma_id)->set('is_active', 0)->update();
                if (!$productPassive) {
                    session()->setFlashdata('danger', '-HATA- Bir hata oluştu');
                    return redirect()->to('panel/category');
                }
                session()->setFlashdata('success', 'BAŞARILI Kategori Ve Ürünler Pasif hale getirildi...');
                return redirect()->to('panel/category');
            }
        }
        if ($info == 0) {
            $categoryActive = $modelcategory->where('id', $id)->where('firma_id', $this->firma->firma_id)->set('is_active', 1)->update();
            if ($categoryActive) {
                $productActive = $modelproducts->where('categories_id', $id)->where('firma_id', $this->firma->firma_id)->set('is_active', 1)->update();
---
SELECT *
FROM `categories`
WHERE `categories`.`id` = '22'
SELECT *
FROM `categories`
WHERE `id` = '33'
AND `firma_id` = '6'
 LIMIT 1
SELECT *
FROM `products`
WHERE `id` = '102'
AND `firma_id` = '6'
AND `products`.`id` = '102'
UPDATE `categories` SET `is_active` = 1
WHERE `id` = '22'
AND `firma_id` = '1'
UPDATE `products` SET `is_active` = 1
WHERE `categories_id` = '22'
AND `firma_id` = '1'

                'haftaSonu' => $haftaSonu,
                'firma_id' => $this->firma->firma_id,
            );
            $settingsUpdate = $modelSettings->where('id', $id)->where('firma_id', $this->firma->firma_id)->set($changeGroup)->update();
---
UPDATE `settings` SET `companyName` = 'Firma İsminiz', `instagramUrl` = 'https://www.freecodecamp.org/', `twitterUrl` = 'asfaf', `facebookUrl` = 'asfa', `location` = 'ilkadım/samsun', `location_url` = 'deneme', `phone` = '0554 189 5255', `mail` = 'asdads@hotmail.com', `hakkimizda` = 'Samsun sahilinin kalbinde, denizin huzur veren manzarası eşliğinde 10 yıldır sizlere hizmet veriyoruz. Kafe olarak amacımız sadece bir kahve sunmak değil; her ziyaretinizde kendinizi evinizde hissetmenizi sağlamak.\r\n\r\nMenümüzde özenle seçilmiş kahveler, sıcak ve soğuk içecekler ile farklı meşrubatlar bulunuyor. Günün her anında, taze ve kaliteli içeceklerimizle küçük bir mutluluk molası vermeniz için buradayız.\r\n\r\nMüşterilerimizle kurduğumuz samimi ilişki, lezzet ve kaliteye olan tutkumuz, 10 yıldır bizimle olan misafirlerimizin en büyük motivasyonu oldu. Sahilde geçirdiğiniz zamanı daha keyifli kılmak için her zaman güleryüzle sizi karşılamaya hazırız.\r\n\r\nBizim için her bardak, bir deneyimdir; her ziyaret, bir anıdır. Gelin, siz de bu deneyimin bir parçası olun.', `haftaIci` = '08:00 - 21:30', `haftaSonu` = '09:00 - 19:00', `wifi` = 'SuperOnline4564', `wifipass` = 'deneme123', `googleyorum` = 'https://search.google.com/local/writereview?placeid=ChIJn9t8b-u5yhQRXVCwl43vu0Q', `firma_id` = '1'
WHERE `id` = '2'
AND `firma_id` = '1'

    public function statusView()
    {
        $modelStatus = new \App\Models\StatusModel();
        $data['status'] = $modelStatus->where('firma_id', $this->firma->firma_id)->first();
---
SELECT *
FROM `status`
WHERE `firma_id` = '1'
 LIMIT 1