app/Controllers/Login.php

SELECT *
FROM `settings`
WHERE `firma_id` = '1'
 LIMIT 1
---
    public function index()
    {

        $model=new \App\Models\SettingsModel();
        $data = $model->where('firma_id', $this->firma->firma_id)->first();

SELECT *
FROM `kullanici`
WHERE `k_adi` = '5541897255'
AND `firma_id` = '1'
 LIMIT 1
---
   public function kontrol()
{
    $model = new \App\Models\KullaniciModel();
    $session = session();

    if ($this->request->getMethod() === 'post') {
        $k_adi = $this->request->getPost('k_adi');
        $k_sifre = md5($this->request->getPost('k_sifre'));

        // Firma kontrolü eklenmiş kullanıcı sorgusu
        $user = $model
            ->where('k_adi', $k_adi)
            ->where('firma_id', $this->firma->firma_id)
            ->first();